{
  "aileen-reid": {
    "name": "Aileen Reid",
    "image": {
      "src": "",
      "alt": "",
      "height": 200,
      "width": 200
    },
    "bio": "Aileen Reid is a professional triathlete from Ireland."
  },
  "luke-mccarron": {
    "name": "Luke McCarron",
    "image": {
      "src": "/hof/lukemccarron.JPG",
      "alt": "Luke McCarron racing",
      "height": 508,
      "width": 475
    },
    "bio": "We are pleased to announce the induction of Luke McCarron into the NWTC Hall of Fame. Since his debut in 2016 as a 17-year-old racing full sprint triathlons, Luke has achieved tremendous success in both sport and academics, building a legacy of dedication, perseverance, and remarkable talent.\n\nAs a junior, Luke’s potential was evident to anyone who saw him race. His speed, endurance, and natural ability stood out, and he was awarded NWTC Athlete of the Year on numerous occasions—an early indication of the incredible journey that lay ahead. His achievements were undeniable, and his performances sparked recognition from those who knew the sport, marking him as a future star.\n\nLuke’s highlights include winning a silver medal at the British Universities and Colleges (BUCS) Triathlon Championships, leading the Cambridge Men’s Triathlon team to their first-ever BUCS medal, and securing the titles of English National Triathlon Champion and Irish National Aquathlon Champion. Most recently, in February 2025, Luke claimed his first international podium, earning bronze at the Asia Triathlon Cup, a monumental achievement in his young career.\n\nLuke’s victory at the 2021 Triathlon Ireland National Aquathlon Championships was another standout moment, where he completed the 1km swim and 5km run in 30:03—a clear reflection of his dedication and skill.\n\nHaving now graduated in Medicine from Jesus College, Cambridge, Luke is embarking on a dual career as both a doctor and a professional triathlete. Despite his success, Luke remains grounded, never forgetting his roots in Derry. Whenever he returns home, he is always eager to give back to the community, helping and training with younger and developing athletes, sharing his experience with genuine humility and generosity.\n\nAs part of the University of Cambridge Athlete Performance Programme (UCAPP), Luke was able to balance his demanding studies and athletic career, benefiting from the programme’s support in areas like physiotherapy, nutrition, and sports psychology. Luke has spoken highly of how UCAPP helped him, noting that it was the first time he felt the University truly understood the importance of sport in the lives of its students.\n\nWhile these achievements are impressive, Luke’s story is far from finished. His journey continues, and we’re eager to see what new heights he will reach in the future. With his drive and determination, it’s clear that the best is yet to come.\n\nTo be continued..."
  },
  "colm-quigley": {
    "name": "Colm Quigley",
    "image": {
      "src": "",
      "alt": "",
      "height": 200,
      "width": 200
    },
    "bio": "Colm Quigley is a professional triathlete from Ireland."
  }
}
